<div class="help">
<div><img src="components/com_jresearch/assets/jresearch_logo.png" alt="J!Research Logo"/></div>
<h1>
	<span>Ayuda sobre J!Research</span>
</h1>
<div style="position: fixed; right: 0pt; top: 0pt;"><a href="#top">Top</a></div>

<h2><a name="top">&Iacute;ndice</a></h2>
<ol class="helpindex">
	<li><a href="#researchareas">&Aacute;reas de Investigaci&oacute;n</a></li>
	<li><a href="#cooperations">Colaboraciones</a></li>
	<li><a href="#facilities">Equipos</a></li>
	<li><a href="#financiers">Fuentes de financiamiento</a></li>
	<li><a href="#projects">Proyectos</a></li>
	<li><a href="#publications">Publicaciones</a></li>
	<li><a href="#staff">Miembros</a></li>
	<li><a href="#teams">Grupos de trabajo</a></li>
	<li><a href="#theses">Tesis de grado</a></li>
	<li><a href="#authorization">Permisos</a></li>
</ol>
		
<ol>
	<li>
		<h2><a name="researchareas">&Aacute;reas de Investigaci&oacute;n</a></h2>
		<p>Los centros de investigaci&oacute;n a menudo trabajan en diferentes &aacute;reas del conocimiento. J!Research permite categorizar la informaci&oacute;n por &aacute;rea de investigaci&oacute;n. 
		Provee vistas para listar las diferentes l&iacute;neas de investigaci&oacute;n as&iacute; como mostrar la descripci&oacute;n detallada de cada una incluyendo los proyectos, publicaciones y tesis
		m&aacute;s recientes en esa &aacute;rea.
	</li>
	
	<li>
		<h2><a name="cooperations">Colaboraciones</a></h2>
		<p>J!Research incluye soporte para colaboraciones, &iacute;tems que almacenan informaci&oacute;n acerca
		de organizaciones externas que colaboran de alguna forma con el centro de investigaci&oacute;n. J!Research
		provee vistas p&uacute;blicas para listarlas y mostrar la informaci&oacute;n detallada de cada una.
		</p>
	</li>
	
	<li>
		<h2><a name="facilities">Equipos</a></h2>
		<p>Equipos disponibles en el centro para actividades de investigaci&oacute;n dentro del centro. J!Research
		permite la administraci&oacute;n de los mismos permitiendo definir informaci&oacute;n como nombre, &aacute;rea
		de investigaci&oacute;n relacionada, foto y descripci&oacute;n.</p>

	</li>
	
	<li><h2><a name="financiers">Fuentes de financiamiento</a></h2>
		<p>Instituciones o convenios que proveen financiamiento para ciertos proyectos dentro del centro. Los proyectos
		pueden ser asociados a m&uacute;ltiples fuentes de financiamiento.</p>
	</li>
	
	<li><h2><a name="projects">Projects</a></h2>
	<p>Los proyectos son las actividades m&aacute;s importantes dentro de un centro de investigaci&oacute;n.
	J!Research permite publicar informaci&oacute;n detallada sobre los proyectos emprendidos incluyendo &aacute;rea de investigaci&oacute;n, estado, miembros (permite definir l&iacute;deres, fechas, fuentes de financiamiento, 
	sitio web del proyecto y descripci&oacute;n. Se pueden publicar listas de proyectos as&iacute; como la descripci&oacute;n detallada de cada uno de ellos. </p>
	
	<li><h2><a name="publications">Publicaciones</a></h2>
	<p>Las publicaciones son el componente m&aacute;s importante y complejo de J!Research ya que la aplicaci&oacute;n brinda un conjunto completo de funcionalidades
	para administrarlas.</p>
	<ol>
		<li>
			<h3>Estilos de citado</h3>
			<p>J!Research incluye soporte para los estilos de citado m&aacute;s populares en el campo acad&eacute;mico para listar publicaciones: </p>			
			<ul>
				<li>APA (American Psychological Association's Style)</li>
				<li>MLA (Modern Language Association's Style)</li>
				<li>Chicago (15th Chicago Manual of Style)</li>
				<li>IEEE (Institute of Electrical and Electronics Engineers' Style)</li>
				<li>CSE (Council of Science Editors' Style)</li>
				<li>Vancouver citation style</li>

			</ul>
		</li>	
		<li>
			<h3>Administraci&oacute;n</h3>
			<p>J!Research fue inicialmente dise&ntilde;ado para ser compatible con los tipos de publicaciones definidos por Bibtex, sin embargo, a partir de la versi&oacute;n 1.1
			se ha inclu&iacute;do el soporte para otros tipos de publicacion. Las publicaciones internas son aquellas que fueron escritas con el patrocinio del centro y pueden
			ser publicadas en la parte p&uacute;blica. Se proveen tres vistas asociadas a publicaciones: </p> 			
			<ul>
				<li>
					<h4>Lista de publicaciones est&aacute;ndar</h4>
					<p>Muestra una lista de publicaciones organizadas por criterios como a&ntilde;o de publicaci&oacute;n, t&iacute;tulo o tipo.</p>
				</li>
	
				<li>
					<h4>Descripci&oacute;n de una publicaci&oacute;n</h4>
				</li>
				<li>
					<h4>Presentaci&oacute;n tabular</h4>
					<p>Muestra una lista de publicaciones en un formato tabulado incluyendo filtros por grupo de trabajo, &aacute;rea de investigaci&oacute;n, autor o tipo.</p>
				</li>
			</ul>
			<p>La interfaz de administraci&oacute;n permite la importaci&oacute;n y exportaci&oacute;n de grupos de publicaciones en los siguientes formatos: </p>	
			<ul>
				<li>Bibtex</li>
				<li>RIS</li>
				<li><a href="http://www.loc.gov/standards/mods/" target="_blank">MODS</a> (Metadata Object Description Schema)</li>

			</ul> 
		</li>	
		<li><h3>Citas</h3>
		<p>Las actividades de investigaci&oacute;n a menudo se basan en trabajo publicado anteriormente. Por esa raz&oacute;, J!Research permite citar publicaciones almacenadas en la base de datos a trav&eacute;s de un plugin para citado autom&aacute;tico en el editor WYSIWYG de Joomla.</p>		
		<p><img src="components/com_jresearch/assets/help/citebar.png"/> Esta barra puede ser encontrada SOLO en el editor TinyMCE de Joomla si J!Research fue correctamente instalado. 
		Cada button inserta un comando en el editor que es automaticamente reemplazado por la cita correcta en el estilo de citado configurado cuando se han enviado los par&aacute;metros correctamente. 
		A excepci&oacute;n del comando <em>bibliography</em>, una o varias claves de citado deben ser prove&iacute;das. </p>

		<ul>
			<li><img src="../plugins/editors/tinymce/jscripts/tiny_mce/plugins/jresearch_automatic_citation/images/cite.png" /> <strong>cite{citekey}</strong> Permite citar una publicaci&oacute;n de forma que el autor de la publicaci&oacute; es el sujeto en la oraci&oacute;n. Algunos estilos de citado podr&iacute;n no definir este comando. No tiene sentido usarlo con m&aacute;s de una publicaci&oacute;n.</li>
			<li><img src="../plugins/editors/tinymce/jscripts/tiny_mce/plugins/jresearch_automatic_citation/images/citep.png" /> <strong>citep{citekey1, citekey2, ... }</strong> Permite citar una o m&aacute;s publicaciones de forma que los autores no son el sujeto de la oraci&oacute;n (usualmente entre par&eacute;ntesis). Algunos estilos de citado podr&iacute;n no definir este comando. </li>
			<li><img src="../plugins/editors/tinymce/jscripts/tiny_mce/plugins/jresearch_automatic_citation/images/citeyear.png" /> <strong>citeyear{citekey1, citekey2, ... }</strong> Permite citar el a&ntilde;o de publicaci&oacute; de una o m&aacute;s elementos.</li>
			<li><img src="../plugins/editors/tinymce/jscripts/tiny_mce/plugins/jresearch_automatic_citation/images/nocite.png" /> <strong>nocite{citekey1, citekey2, ... }</strong> Permite citar una o m&aacute;s publicaciones, pero no inserta ning&uacute;n texto. Sin embargo, las publicaciones son tomadas en cuenta al momento de generar la lista de referencias en respuesta al comando <em>bibliography</em></li>
			<li><img src="../plugins/editors/tinymce/jscripts/tiny_mce/plugins/jresearch_automatic_citation/images/bibliography.png" /> <strong>bibliography{}</strong> Inserta una lista de referencias en base a los elementos citados y al estilo de citado configurado.</li>
		</ul>
		<p><img src="components/com_jresearch/assets/help/joomlacitebar.png"/>Adicionalmente, J!Research provee una interfaz para citar elementos para aquellos usuarios que no cuentan con el editor TinyMCE, la misma que es accedida a trav&eacute;s de los botones mostrados. &Eacute;stos aparecen en la parte inferior del editor.</p>
		</li>
	
	</ol>
	
	<li>
	<h2><a name="staff">Miembros</a></h2>
	<p>J!Research permite la administraci&oacute;n de los miembros del centro. La informaci&oacute;n b&aacute;sica como nombre y correo electr&oacute;nico es importada de la tabla de usuarios de Joomla. 
	Se proveen vistas para listar miembros y editar perfil para usuarios autenticados que sean miembros de J!Research. 
	Vale la pena recalcar, que J!Research permite asociar personas que no sean miembros del centro a las actividades como proyectos, publicaciones, entre otras, con solo ingresar su nombre en vez de seleccionarlas de la lista de miembros disponibles.</p>	
	</li>
	
	<li>
	<h2><a name="teams">Grupos de trabajo</a></h2>
	<p></p>
	</li>
	
	<li>
	<h2><a name="theses">Tesis de grado</a></h2>
	<p>El manejo de tesis de grado es parte de J!Research debido a que los miembros de los centros a menudo se involucran en este tipo de actividad ya sea como directores o estudiantes.
	Al igual que las otras entidades pueden ser listadas y detalladas desde la parte p&uacute;blica del sitio.
	</p>	

	</li>
	<li>
	<h2><a name="authorization">Authorization</a></h2>
	<p></p>
	</li>
	
</ol>
</div>
